<template>
  <button @click="click">{{ text }}</button>
</template>

<script>
export default {
  name: "my-button",
  props: {
    text: {
      type: String,
      require: true,
    },
  },
  methods: {
    click() {
      this.$emit("click");
    },
  },
};
</script>

<!-- 
  Тут немного не правильно, по сути стили кнопки должны быть инкапсулированны в самом компоненте
  
  Как лучше сделать, добавляешь новый пропс "type" или "variant" и это будет какая-то строка, которыю ты будешь передавать из вне
  Если тебе нужна кнопка, которая выглядит по другому, добавляешь новый тип, допустим type="outline"
  После в самой кнопке прокидываешь этот тип как класс
  <button class="my-button button_type_outline" @click="click">{{ text }}</button>
  и в зависимости от класса меняешь стилистику
  
  Еще например у тебя есть кнопка, сделанная через падинги, но в каком-то кейсе тебе нужно чтобы кнопка занимала всю ширину
  Создаешь пропс fullWidth, если он true - прокидываешь новый класс button_size_full
  И по этому классу делаешь 
  .button_size_full {
    width: 100%
  }

  Это я все к тому, что нужно учиться инкапсулировать все что касается компонента, внутри самого компонента, а иначе какой в этом смысл
 -->
